Autodesk.Revit.UI.SnappingServiceData.GetLocalToPage(Autodesk.Revit.DB.XYZ)
Transforms local coordinates of a point to page coordinates.
Inpoint:
Input the point local coordinates
Returns:
Return the transformed coordinates
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL

Autodesk.Revit.UI.SnappingServiceData.GetARCQueryForActiveView(Autodesk.Revit.DB.PointCloudType)
Gets ARCQuery corresponding to the type and active view.
type:
PointCloudType from which to get the ARCQuery
Returns:
The returned pointer can be NULL if the ARCQuery is NULL
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL

Autodesk.Revit.UI.SnappingServiceData.AddPointSnaps(System.Collections.Generic.IList{Autodesk.Revit.DB.XYZ})
Takes point snaps from the instance of ISnappingServer and passes them to Revit.
pointSnaps:
The points to add as snaps.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL

Autodesk.Revit.UI.SnappingServiceData.AddLineSnaps(System.Collections.Generic.IList{Autodesk.Revit.DB.XYZ},System.Boolean)
Takes line snaps from the instance of ISnappingServer and passes them to Revit.
lineSnaps:
Lines are represented by two XYZs: first an origin, then a direction.
projectToWorkPlane:
Whether to project the lines to the work plane. For instance, if the line snaps represent
planes, we want to project them. If they represent cylinders, we do not. If we project
to the work plane, we also verify that the line is parallel to the work plane.
Throws Autodesk.Revit.Exceptions.ArgumentException:
the array lineSnaps has an odd number of entries and is hence not a valid line snap
array, since lines are represented as an origin XYZ followed by a direction XYZ.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL

Autodesk.Revit.UI.SnappingServiceData.GetVisibleScanGUIDs(Autodesk.Revit.DB.PointCloudInstance)
Given a PointCloudInstance, get those of its scans which are visible in the View in which
snapping is being done.
pointCloudInstance:
The PointCloudInstance to get scans from.
Returns:
The GUIDs of the scans of the given PointCloudInstance visible in the View in which
snapping is being done.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL

Autodesk.Revit.UI.SnappingServiceData.GetPlanes(Autodesk.Revit.DB.PointCloudInstance)
Gets the bounding planes for the given point cloud.
pointCloudInstance:
The point cloud to find the bounding planes for.
Returns:
The bounding planes for the given point cloud.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL

Autodesk.Revit.UI.SnappingServiceData.GetReCapNativeAccess(Autodesk.Revit.DB.PointCloudType)
Returns native pointer to IRCData object that corresponds to
a loaded and open point cloud in ReCap SDK
Remarks:
The returned pointer can be NULL if the point cloud has been unloaded
or if this point cloud uses different engine than ReCap
type:
PointCloudType from which to get the IRCData
Returns:
The access pointer
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL